Autodesk.Revit.DB.BuiltInFailures.ScheduleViewFailures.SegmentsStartIsGreaterThanSegmentsEnd
Change values so Segments End is greater than or equal to Segments Start.

Autodesk.Revit.DB.BuiltInFailures.ScheduleViewFailures.SchedulesCanBePlacedOnSheetsOnly
Schedules can only be placed on Sheets.

Autodesk.Revit.DB.BuiltInFailures.ScheduleViewFailures.PanelScheduleSlotInconsistency
The template applied to this panel schedule is set to display fewer slots than what is needed to display the maximum number of 1-pole breakers set on the equipment.

Autodesk.Revit.DB.BuiltInFailures.ScheduleViewFailures.PanelScheduleLoadClassInconsistency
You have one or more loads connected to this panel that are not displayed in the panel schedule.
Add the load classification(s) to the associated template to report this information in the Loads Summary.

Autodesk.Revit.DB.BuiltInFailures.ScheduleViewFailures.NotGridName
'[Text]' is not a Grid line name

Autodesk.Revit.DB.BuiltInFailures.ScheduleViewFailures.NoColumnsJoinedToGridLines
No columns are joined to grid lines, or view parameters exclude all columns.

Autodesk.Revit.DB.BuiltInFailures.ScheduleViewFailures.DuplicateFieldRemovedFromKeySchedule
Duplicate fields across key schedules will be removed after paste.

Autodesk.Revit.DB.BuiltInFailures.ScheduleViewFailures.ColumnsExcluded
Some columns in the project are excluded from the graphical column schedule view.

Autodesk.Revit.DB.BuiltInFailures.ScheduleViewFailures.ColumnsExceedSegment
Some columns in Graphical Column Schedule exceed the segment's upper/lower bounds.  You can add levels or adjust the view parameters.

Autodesk.Revit.DB.BuiltInFailures.ScheduleViewFailures.CannotResizeColumn
Can't resize column.

Autodesk.Revit.DB.BuiltInFailures.ScheduleViewFailures.BadViewType
Schedules can only be placed on Sheets.

Autodesk.Revit.DB.BuiltInFailures.ScheduleViewFailures
Failures about Schedule.